{
  "paper_id": "arXiv_2403.11254v1",
  "title": "Efficiently Detecting Reentrancy Vulnerabilities in Complex Smart Contracts",
  "authors": [
    "Zexu Wang",
    "Jiachi Chen",
    "Yanlin Wang",
    "Yu Zhang",
    "Weizhe Zhang",
    "Zibin Zheng"
  ],
  "year": 2024,
  "abstract": "Reentrancy vulnerability as one of the most notorious vulnerabilities, has\nbeen a prominent topic in smart contract security research. Research shows that\nexisting vulnerability detection presents a range of challenges, especially as\nsmart contracts continue to increase in complexity. Existing tools perform\npoorly in terms of efficiency and successful detection rates for\nvulnerabilities in complex contracts. To effectively detect reentrancy\nvulnerabilities in contracts with complex logic, we propose a tool named SliSE.\nSliSE's detection process consists of two stages: Warning Search and Symbolic\nExecution Verification. In Stage I, SliSE utilizes program slicing to analyze\nthe Inter-contract Program Dependency Graph (I-PDG) of the contract, and\ncollects suspicious vulnerability information as warnings. In Stage II,\nsymbolic execution is employed to verify the reachability of these warnings,\nthereby enhancing vulnerability detection accuracy. SliSE obtained the best\nperformance compared with eight state-of-the-art detection tools. It achieved\nan F1 score of 78.65%, surpassing the highest score recorded by an existing\ntool of 9.26%. Additionally, it attained a recall rate exceeding 90% for\ndetection of contracts on Ethereum. Overall, SliSE provides a robust and\nefficient method for detection of Reentrancy vulnerabilities for complex\ncontracts.",
  "venue": "Accepted at FSE 2024",
  "conference": "FSE",
  "journal": null,
  "volume": null,
  "pages": null,
  "doi": null,
  "arxiv_id": "2403.11254v1",
  "url": "http://arxiv.org/abs/2403.11254v1",
  "pdf_url": "http://arxiv.org/pdf/2403.11254v1",
  "pdf_path": "papers_external/pdfs/FSE24_Efficiently_Detecting_Reentrancy_Vulnerabilities_in_Complex.pdf",
  "citations": 0,
  "keywords": [
    "additionally",
    "complex smart contracts reentrancy",
    "cs.se",
    "efficiently detecting reentrancy vulnerabilities",
    "ethereum",
    "existing",
    "in stage",
    "inter",
    "overall",
    "program dependency graph",
    "reentrancy",
    "research",
    "security",
    "smart-contracts",
    "symbolic\nexecution verification",
    "verification",
    "vulnerability",
    "warning search"
  ],
  "topics": [
    "gas optimization",
    "reentrancy",
    "security",
    "smart contract",
    "testing",
    "verification"
  ],
  "source": "arxiv",
  "added_date": "2025-11-09T22:59:16.473697",
  "bibtex": "@inproceedings{Wang2024,\n  title={Efficiently Detecting Reentrancy Vulnerabilities in Complex Smart Contracts},\n  author={Zexu Wang and Jiachi Chen and Yanlin Wang and Yu Zhang and Weizhe Zhang and Zibin Zheng},\n  year={2024},\n  booktitle={FSE},\n  url={http://arxiv.org/abs/2403.11254v1}\n}"
}